In [76]:
# %%
import pandas as pd
import numpy as np
from sklearn import linear_model

df = pd.read_csv('kamar.csv')
df

   luas kamartidur  kamarmandi      harga
0   120          3           2  130000000
1   135          3           3  148000000
2   140                      4  160000000
3   180          5           3  210000000
4   220          6           5  285000000

In [77]:
# %%
# at untuk mengisi value (0), index ke=2 kolom kamartidur
# Cell yang kosong diisi dengan nilai 0 terlebih dahulu
df.at[2, 'kamartidur'] = 0
df

   luas kamartidur  kamarmandi      harga
0   120          3           2  130000000
1   135          3           3  148000000
2   140          0           4  160000000
3   180          5           3  210000000
4   220          6           5  285000000

In [78]:
# %%
# Mengganti nilai 0 menjadi NaN (Not a Number)

df.replace(0, np.nan, inplace=True)
df

   luas kamartidur  kamarmandi      harga
0   120          3           2  130000000
1   135          3           3  148000000
2   140        NaN           4  160000000
3   180          5           3  210000000
4   220          6           5  285000000

In [79]:
# %%
# Mencari nilai median dari kolom kamarTidur
df.kamartidur.median()

4.0

In [80]:
# %%
# Membulatkan nilai kebawah
import math
nilai_median_kamnartidur = math.floor(df.kamartidur.median())
nilai_median_kamnartidur

4

In [86]:
# fillna untuk mengganti NaN value
df.kamartidur.fillna(nilai_median_kamartidur)

0    3
1    3
2    4
3    5
4    6
Name: kamartidur, dtype: object

In [81]:

# Menampilkan value yang baru kedalam DataFrame
df.kamartidur = df.kamartidur.fillna(nilai_median_kamartidur)
df

   luas kamartidur  kamarmandi      harga
0   120          3           2  130000000
1   135          3           3  148000000
2   140          4           4  160000000
3   180          5           3  210000000
4   220          6           5  285000000

In [82]:
# Modul regresi linear
reg = linear_model.LinearRegression()
reg.fit(df[['luas', 'kamartidur', 'kamarmandi']], df.harga)

# %% 
# Menampilkan nilai slope (jika dibutuhkan)
reg.coef_

array([ 1492322.09737828, -1900749.06367043,  4544943.82022473])

In [83]:
# %%
# Menampilkan nilai intersep (jika dibutuhkan)
reg.intercept_

-58148876.404494435

In [84]:
# %%
# Prediksi
int(reg.predict([[245,7,7]]))

d:\Kuliah\Pemrograman-python\tasks\task-6\env\Lib\site-packages\sklearn\base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

325979400

In [85]:
# pembuktian
1492322.09737828*245+-1900749.06367043*7+4544943.82022473*7+-58148876.404494435

325979400.7490642